"Part1" = "SUOMI";
"Part2" = "APPLE INC.";
"Part3" = "iOS-OIKOTEIDEN OHJELMISTOLISENSSISOPIMUS";
"Part4" = "LUE TÄMÄ OHJELMISTOLISENSSISOPIMUS (”LISENSSI”) HUOLELLISESTI ENNEN APPLE-OHJELMISTON KÄYTTÖÄ. APPLE-OHJELMISTOA KÄYTTÄMÄLLÄ SITOUDUT NOUDATTAMAAN TÄMÄN LISENSSIN EHTOJA. ELLET HYVÄKSY LISENSSIN EHTOJA, ÄLÄ ASENNA JA/TAI KÄYTÄ OHJELMISTOA.";
"Part5" = "TÄRKEÄ HUOMAUTUS: Siltä osin kuin tätä ohjelmistoa voidaan käyttää aineiston jäljentämiseen, muokkaamiseen, julkaisemiseen ja jakelemiseen, Lisenssi sallii sinulle ainoastaan sellaisen aineiston jäljentämisen, muokkaamisen, julkaisemisen ja jakelemisen, joka ei ole tekijänoikeuksien suojaamaa tai johon sinulla on tekijänoikeus tai jonka jäljentämiseen, muokkaamiseen, julkaisemiseen tai jakelemiseen sinulla on valtuutus tai laillinen lupa. Jos olet epävarma oikeudestasi jäljentää, muokata, julkaista ja jaella aineistoa, ota yhteyttä lainopilliseen neuvonantajaan.";
"Part6" = "1. Yleistä.";
"Part7" = "A. Apple-ohjelmisto ja muiden valmistajien ohjelmat, dokumentaatio, käyttöliittymät, sisältö, fontit ja muu tämän Lisenssin mukana tuleva tieto, olipa se sitten kirjoitussuojatussa muistissa, millä tahansa muulla medialla tai missä tahansa muussa muodossa (yhteisnimitykseltään ”Apple-ohjelmisto”) on lisensoitu, ei myyty, sinulle Apple Inc:n (”Apple”) toimesta käytettäväksi ainoastaan tämän Lisenssin ehtojen mukaisesti. Apple ja/tai Applen lisensoijat säilyttävät omistajuutensa Apple-ohjelmistoon ja pidättävät itsellään kaikki oikeudet, joita ei ole erikseen annettu sinulle. ";
"Part8" = "B. Apple voi oman harkintansa mukaan tulevaisuudessa tarjota suurempia tai pienempiä päivityksiä yhteensopivien Apple-merkkisten iOS-laitteittesi Apple-ohjelmistoon. Mahdolliset suuret tai pienet Apple-ohjelmistopäivitykset eivät välttämättä sisällä kaikkia nykyisiä ohjelmisto-ominaisuuksia tai uusia ominaisuuksia, jotka Apple julkaisee uudemmille tai muille iOS-laitteiden malleille. Tämän Lisenssin ehdot kattavat Applen tarjoamat suuret ja pienet ohjelmistopäivitykset alkuperäiseen Apple-ohjelmistotuotteeseen, ellei tällaisen suuren tai pienen päivityksen mukana tule erillistä lisenssiä, jolloin kyseisen lisenssin ehdot koskevat kyseistä päivitystä. ";
"Part9" = "2. Lisenssin käyttö ja rajoitukset.";
"Part10" = "A. Lisenssi. Tämän Lisenssin ehtojen puitteissa ja Applen mediapalveluehtoihin sisältyvien palveluiden sekä sisällön käyttöehtojen (https://www.apple.com/legal/internet-services/itunes/) (”Käyttöehdot”) sen salliessa, ellet ole hankkinut Apple-ohjelmistoa kohdassa 2B kuvatulla tavalla, sinulle myönnetään rajoitettu, ei-siirrettävä, rinnakkainen oikeus asentaa Apple-ohjelmisto ja käyttää sitä missä tahansa omistamassasi tai hallitsemassasi yhteensopivassa Apple-merkkisessä iOS-laitteessa. Sinulla ei ole oikeutta jaella Apple-ohjelmistoa tai tarjota sitä verkossa, josta useat laitteet voisivat käyttää sitä samaan aikaan. Sinulla ei ole oikeutta vuokrata, liisata, lainata, myydä, jaella edelleen tai jatkolisensoida Apple-ohjelmistoa.";
"Part11" = "B. Määrä- tai ylläpitolisenssi. Jos hankit Apple-ohjelmiston määrä- tai ylläpitolisenssiohjelman alaisena Applelta, määrä- tai ylläpitolisenssisi määrää Apple-ohjelmiston kopioiden määrän, joka sinulla on lupa ladata, asentaa ja käyttää omistamissasi tai hallitsemissasi Apple-merkkisissä iOS-laitteissa. Ellei Apple kirjallisesti salli toisin, tämän Lisenssin kaikkia muita ehtoja sovelletaan määrä- tai ylläpitolisenssin alaisena hankittuun Apple-ohjelmistosi käyttöön.";
"Part12" = "C. Järjestelmävaatimukset. Apple-ohjelmisto on tuettu ainoastaan Apple-merkkisissä järjestelmissä, jotka täyttävät Applen esittämät täsmälliset järjestelmävaatimukset.";
"Part13" = "D. Sisältö ja digitaalinen aineisto. Apple-ohjelmiston kautta näytetyn tai käytetyn sisällön, mukaan lukien tavaramerkit, logot ja kuvat, omistus- ja tekijänoikeudet kuuluvat vastaavalle omistajalle. Tällaista sisältöä saattavat suojata tekijänoikeus-, tavaramerkki- tai muut omistusoikeudelliset lait ja sopimukset ja sisältö saattaa olla tällaista sisältöä tarjoavan muun valmistajan käyttöehtojen alainen. Lukuun ottamatta mitä muuten tässä Lisenssissä on todettu, (i) tämä Lisenssi ei oikeuta sinua käyttämään kyseistä sisältöä eikä se takaa että sellainen sisältö on jatkossa sinun käytettävissäsi ja (ii) sinulla ei ole oikeutta käyttää, ottaa erilleen tai levittää kaupallisesti tai muilla tavoin itsenäisinä osina valokuvia, logoja, tekstiä, koodia, kuvia, grafiikoita, kuvitusta, ääntä, videota tai vastaavaa aineistoa (”Digitaalinen aineisto”) joita Apple-ohjelmisto sisältää tai jotka tarjotaan sen osana tai käyttää muilla tavoin Digitaalista aineistoa muussa yhteydessä kuin sen aiotussa käytössä osana Apple-ohjelmistoa.";
"Part14" = "E. Oikoteiden käyttö. Hyväksyt, että kaikki appien ja/tai verkkosivustojen toimintojen oikotiet (”Oikotiet”) ovat yksinomaan Oikoteiden alkuperäisen osapuolen tai alkuperäisten osapuolten vastuulla. Apple ei hallitse eikä ole vastuussa muiden valmistajien Oikoteiden sisällöstä tai toiminnallisuudesta. Kannat itse riskin minkä tahansa Oikotien käytöstä ja olet yksin vastuussa Oikotien käyttöön liittyvien muiden valmistajien ehtojen ja sopimusten noudattamisesta. Hyväksyt, että Applella ei ole velvollisuutta ennakkotarkastaa Oikoteitä, vaikka Apple pidättää itsellään oikeuden oman harkintansa mukaan ennakkotarkastaa, kieltäytyä kelpuuttamasta, tehdä toimimattomaksi tai poistaa mitä tahansa Oikoteitä. ";
"Part15" = "F. Oikoteiden jakaminen. Apple-ohjelmisto saattaa sallia luomiesi Oikoteiden jakamisen muiden kanssa verkkolinkin avulla. Jakamasi Oikotie sekä mikä tahansa siihen sisällytetty sisältö tallennetaan Applen palvelimille jakamisen mahdollistamista varten ja sitä saatetaan käyttää Applen tuotteiden ja palveluiden parantamista varten. Jakamasi Oikotie sekä mikä tahansa siihen sisällytetty sisältö on saatavilla kenelle tahansa, jolla on pääsy verkkolinkkiin. Kyseinen taho voi kopioida, tallentaa, muokata ja jakaa edelleen Oikotien ja kaiken siihen sisällytetyn sisällön. Jakamalla Oikotien vakuutat, että: (1) sinulla on kaikki tarvittavat oikeudet ja lisenssit kyseiseen Oikotiehen ja että se ei loukkaa tai riko kenenkään toisen osapuolen oikeuksia; ja (2) jakamasi Oikotie ei riko lakia, myötävaikuta tai rohkaise loukkaavaan tai muutoin lainvastaiseen käyttäytymiseen tai ole muutoin siveetöntä tai paheksuntaa herättävää. Hyväksyt, että Applella ei ole velvollisuutta tarkastaa jakamiasi Oikoteitä, vaikka Apple pidättää itsellään oikeuden oman harkintansa mukaan tarkastaa, kieltäytyä kelpuuttamasta, tehdä toimimattomaksi tai poistaa mitä tahansa jakamiasi Oikoteitä.";
"Part16" = "G. Käyttöä koskevat rajoitukset. Suostut siihen, että et lähetä, julkaise, lähetä sähköpostissa, välitä, jaa tai aseta saataville muulla tavoin Oikotietä, joka: (1) on laiton, rikkomuksellinen, halventava, vulgaari, siveetön, kunniaa loukkaava tai rasistinen, etnisesti tai muutoin loukkaava; (2) rikkoo tai rohkaisee käyttäytymiseen, joka rikkoisi sovellettavia lakeja tai määräyksiä, tai josta seuraisi siviilioikeudellinen vastuu; (3) edistää yksilöön tai ryhmään kohdistuvaa syrjintää, kiihkoilua, rasismia, vihaa, ahdistelua tai vahinkoa; (4) on väkivaltainen tai uhkaava tai edistää väkivaltaa tai toimia, jotka ovat toista henkilöä kohtaan uhkaavia; (5) edistää laittomia tai vahingollisia toimia; tai (6) jonka tiedät tai epäilet olevan virheellinen, harhaanjohtava, petollinen tai millään tavalla harhauttava tällaisen Oikotien käyttäjää kohtaan. Lisäksi suostut olemaan häiritsemättä, keskeyttämättä tai kuormittamatta turhaan Apple-ohjelmistoon tai mihin tahansa muiden valmistajien ohjelmistoihin, palveluihin tai verkkosivustoihin liittyviä palvelimia tai verkkoja iOS-laitteellasi (”Muiden valmistajien apit”) tai rikkomatta tällaisten verkkojen tai muiden valmistajien appien säännöksiä, käytäntöjä ja menettelyjä.";
"Part17" = "H. Kolmansien osapuolten ohjelmat. Jotta tiettyjä Oikoteitä voidaan suorittaa, Apple-ohjelmisto saattaa tarvita pääsyn tiettyihin muiden valmistajien appeihin. Annat nimenomaisesti suostumuksesi ja valtuutat Apple-ohjelmiston käyttämään näitä muiden valmistajien appeja puolestasi siinä määrin kuin on tarpeen Oikotien suorittamista varten Apple-ohjelmiston yhteydessä. Mikäli Apple-ohjelmistolla on pääsy muiden valmistajien appeihin, Applella ei ole suoraa tai välillistä velvollisuutta tarjota mitään teknistä tai muuta tukea kyseisille muiden valmistajien apeille. Ota ohjelmistoon, palveluun, verkkosivustoon ja/tai tuotteisiin liittyvissä teknisen tuen ja asiakaspalvelun asioissa yhteyttä suoraan kyseisen ohjelmiston myyjään, valmistajaan tai palveluntarjoajaan. LISÄKSI HYVÄKSYT, ETTÄ SITOUDUT NOUDATTAMAAN KAIKKIA SOVELTUVIA PALVELUEHTOJA TAI MUITA SOPIMUKSIA TÄLLAISTEN MUIDEN VALMISTAJIEN APPIEN YHTEYDESSÄ KÄYTTÄESSÄSI APPLE-OHJELMISTOA. OLET YKSIN VASTUUSSA SIITÄ, ETTÄ KAIKKI OIKOTIET NOUDATTAVAT OIKOTIEN KÄYTTÄMÄN MUUN VALMISTAJAN APIN SOVELTUVIA EHTOJA. APPLE EI TAKAA MILLÄÄN TAVALLA, ETTÄ OIKOTIET NOUDATTAVAT MUIDEN VALMISTAJIEN APPIEN EHTOJA, EIKÄ APPLE OLE VASTUUSSA MISTÄÄN MUIDEN VALMISTAJIEN OIKOTEISTÄ.";
"Part18" = "I. Ei takaisinmallinnusta. Sitoudut siihen, että et saa kopioida (muutoin kuin tässä Lisenssissä tai Käyttöehdoissa on erikseen sallittu, jos ne koskevat sinua), takaisinkääntää, takaisinmallintaa tai yrittää muuten palauttaa lähdekoodiksi tai muokata Apple-ohjelmistoa, sen tarjoamia palveluita tai mitään niiden osia, purkaa niiden salausta tai luoda niiden pohjalta johdannaisteoksia etkä antaa muille mahdollisuutta tehdä näin (muutoin kuin ainoastaan mikäli ja siinä määrin kuin jonkin edellä mainitun rajoituksen estää sovellettava laki tai Apple-ohjelmiston mahdollisesti sisältämien avoimen lähdekoodin komponenttien käyttöä koskevat lisenssiehdot).";
"Part19" = "J. Lakien noudattaminen. Sitoudut käyttämään Apple-ohjelmistoa ja Palveluita (kuten määritetty osiossa 4 alla) noudattaen kaikkia sovellettavia lakeja, mukaan lukien paikalliset lait maassa tai alueella, jossa asut tai jossa latasit tai käytät Apple-ohjelmistoa ja Palveluita.";
"Part20" = "K. Automaattiset päivitykset. Jos valitset, että suostut automaattisiin päivityksiin, laitteesi tarkistaa ajoittain Applelta onko Apple-ohjelmistoosi saatavilla suuria tai pieniä päivityksiä. Jos suuri tai pieni päivitys on saatavilla, se ladataan ja asennetaan automaattisesti laitteeseesi ja jos sovellettavissa, myös oheislaitteisiisi. Voit laittaa automaattiset appipäivitykset kokonaan pois päältä koska tahansa muuttamalla Asetuksissa olevaa automaattisten appipäivitysten asetusta.";
"Part21" = "3. Suostumus tiedon käyttöön. ";
"Part22" = "A. Analyysitiedot. Jos suostut analyysitietojen keräämiseen, hyväksyt, että Apple ja sen tytäryritykset ja edustajat saattavat kerätä, ylläpitää, käsitellä ja käyttää vianmääritykseen liittyvää, teknistä, käyttöä koskevaa ja vastaavaa tietoa iOS-laitteestasi, mukaan lukien rajoituksetta yksilölliset järjestelmän tai laitteiston tunnisteet, tietokoneeseesi, järjestelmääsi, ohjelmistoosi ja oheislaitteisiisi liittyvät tiedot, joita kerätään ajoittain, jotta Applen tuotteita ja palveluita voidaan tarjota ja parantaa, jotta sinulle voidaan paremmin tarjota ohjelmistopäivityksiä, tuotetukea ja mahdollisia muita Apple-ohjelmistoon liittyviä palveluita ja jotta voidaan varmistaa tämän Lisenssin ehtojen noudattaminen. Apple saattaa käyttää näitä tietoja yllä kuvattuihin tarkoituksiin edellyttäen, että ne on kerätty muodossa, josta sinua ei voida suoraan tunnistaa. Jotta Apple voi tarjota yhteistyökumppaneilleen ja muiden valmistajien kehittäjille mahdollisuuden parantaa Applen tuotteiden kanssa käytettäviksi tarkoitettuja ohjelmistojaan, laitteistojaan ja palvelujaan, Apple voi myös tarjota kenelle tahansa tällaiselle yhteistyökumppanille tai muun valmistajan kehittäjälle tietyn määrän vianmääritystietoa, jolla on merkitystä kyseisen yhteistyökumppanin tai kehittäjän ohjelmiston, laitteiston ja/tai palveluiden kannalta, niin kauan kuin vianmääritystieto on muodossa, josta sinua ei voida tunnistaa henkilökohtaisesti. ";
"Part23" = "B. Sijaintitiedot. Apple ja sen kumppanit, lisenssinhaltijat ja muiden valmistajien kehittäjät voivat tarjota Apple-ohjelmiston kautta palveluita, jotka hyödyntävät sijaintitietoja. Apple ja sen yhteistyökumppanit ja lisenssinhaltijat ja muiden valmistajien kehittäjät voivat näiden mahdollisesti saatavilla olevien palveluiden tarjoamista ja kehittämistä varten välittää, kerätä, ylläpitää, käsitellä ja käyttää tietoja sijainnistasi. Applen keräämät sijaintitiedot ja -kyselyt kerätään muodossa, josta sinua ei voida henkilökohtaisesti tunnistaa, ja Apple, sen yhteistyökumppanit ja lisenssinhaltijat ja muiden valmistajien kehittäjät voivat käyttää kyseisiä tietoja tarjotakseen ja parantaakseen sijaintiin perustuvia tuotteita ja palveluita. Käyttämällä mitä tahansa sijaintiin perustuvia palveluita Apple-ohjelmistolla tai sen kautta hyväksyt Applen, sen yhteistyökumppanien ja lisenssinhaltijoiden ja kolmansien osapuolten kehittäjien harjoittaman sijaintitietojesi ja -kyselyidesi välittämisen, keräämisen, ylläpitämisen, käsittelemisen ja käytön kyseisten tuotteiden ja palveluiden tarjoamiseksi ja parantamiseksi. Voit perua suostumusesi milloin tahansa avaamalla Sijaintipalvelut-asetuksen iOS-laitteessasi ja joko asettamalla pois päältä kaikki apit kattavan Sijaintipalvelut-asetuksen tai asettamalla pois päältä yksittäisen apin asetuksen. Kun käytät iOS-laitteessa muiden valmistajien appeja tai palveluita, jotka käyttävät tai tarjoavat sijaintidataa, sinua koskevat kyseisen muun valmistajan ehdot ja tietosuojakäytännöt kyseisten muiden valmistajien appien tai palveluiden sijaintidatan käytön osalta, ja sinun tulee tutustua kyseisiin ehtoihin ja tietosuojakäytäntöihin.";
"Part24" = "C. Tietosuojakäytäntö. Tietojasi käsitellään aina Applen tietosuojakäytännön mukaisesti, joka on luettavissa osoitteessa: https://www.apple.com/fi/legal/privacy/.";
"Part25" = "4. Palvelut ja muiden valmistajien aineisto.";
"Part26" = "A. Yleistä. Apple-ohjelmisto saattaa mahdollistaa pääsyn Applen iTunes Storeen, App Storeen, iCloudiin, Karttoihin ja muihin Applen ja muiden valmistajien palveluihin ja verkkosivustoihin (yhdessä ja erikseen ”Palvelut”). Kyseiset Palvelut eivät ehkä ole saatavilla kaikilla kielillä tai kaikissa maissa. Näiden Palveluiden käyttö edellyttää internet-yhteyttä, ja joidenkin Palveluiden käyttö voi edellyttää Apple ID:tä ja erillisten palveluehtojen hyväksymistä ja voi olla erikseen maksullista. Käyttämällä tätä ohjelmistoa yhdessä iTunes Store -tilin, Apple ID:n tai muun Applen palvelun kanssa sitoudut kyseistä palvelua koskeviin palveluehtoihin, kuten uusimpiin Applen mediapalveluehtoihin, joihin voit perehtyä osoitteessa https://www.apple.com/legal/internet-services/itunes/.";
"Part27" = "B. Jos päätät käyttää iCloud-palveluita Apple-ohjelmistollasi, on käyttö seuraavien ehtojen alaista: iCloudin ehdot ja määräykset, luettavissa osoitteessa https://www.apple.com/legal/internet-services/icloud/ ja Applen tietosuojakäytäntö, luettavissa osoitteessa https://www.apple.com/fi/legal/privacy/.";
"Part28" = "C. Ymmärrät, että käyttäessäsi Palveluita saatat kohdata sisältöä, jota voidaan pitää loukkaavana, siveettömänä tai sopimattomana ja joka saattaa sisältää rumaa kieltä. Hyväksyt, että käytät Palveluita omalla vastuullasi ja että Apple ei ole vastuussa sisällöstä, joka on ehkä loukkaavaa, siveetöntä tai sopimatonta. ";
"Part29" = "D. Tietyt Palvelut voivat näyttää, sisältää tai tuoda saataville muiden valmistajien sisältöä, dataa, tietoja, appeja tai aineistoa (”Muiden valmistajien aineisto”) tai tarjota linkkejä tietyille muiden valmistajien verkkosivustoille tai appeihin. Käyttämällä Palveluita osoitat hyväksyväsi, että Applen vastuulla ei ole tarkastaa tai arvioida Muiden valmistajien aineiston, appien tai verkkosivustojen sisältöä, täsmällisyyttä, kattavuutta, ajantasaisuutta, pätevyyttä, tekijänoikeuksien kunnioittamista, laillisuutta, sopivuutta, laatua tai muita ominaisuuksia. Apple, sen edustajat, sen konserniyhtiöt tai tytäryritykset eivät anna takuita tai suosituksia tai ole vastuussa sinulle tai kenellekään muulle koskien muiden valmistajien Palveluita, Muiden valmistajien aineistoa, appeja tai verkkosivustoja tai mitään muuta muiden valmistajien aineistoa, tuotteita tai palveluita. Muiden valmistajien aineistoa ja linkkejä muille verkkosivustoille tai appeihin tarjotaan vain käytön helpottamiseksi. ";
"Part30" = "E. Siltä osin kuin lataat mitään sisältöä näiden Palveluiden kautta vakuutat, että omistat kyseisen sisällön tai sinulla on tarvittava laillinen oikeus tai lupa lähettää sitä, ja että kyseinen sisältö ei riko Palveluihin sovellettavia palveluehtoja. Hyväksyt, että Palveluissa on omisteista sisältöä, tietoa ja aineistoa mukaan lukien rajoituksetta kaikki Digitaalinen aineisto, jonka omistavat Apple, sivuston omistaja ja/tai niiden lisensoijat ja jota suojaavat siihen sovellettavat immateriaalioikeutta koskevat ja muut lait mukaan lukien rajoituksetta tekijänoikeudet. Hyväksyt, että et käytä tällaista omisteista sisältöä, tietoa tai aineistoa millään muulla tavoin kuin käyttämällä Palveluita sallitusti tai millään tavalla, joka on ristiriidassa tämän Lisenssin ehtojen kanssa tai loukkaa Applen tai muun valmistajan immateriaalioikeuksia. Palveluiden mitään osaa ei saa jäljentää missään muodossa tai millään keinolla. Sitoudut olemaan muokkaamatta, vuokraamatta, liisaamatta, lainaamatta, myymättä tai levittämättä Palveluita tai luomatta niistä johdannaisteoksia millään tavalla ja olemaan käyttämättä Palveluita millään ei-sallitulla tavalla, mukaan lukien rajoituksetta Palveluiden käyttäminen tietokonevirusten, matojen, troijalaisten tai muiden haittaohjelmien levittämiseen tai verkon luvattomaan käyttöön tai kuormittamiseen. Lisäksi sitoudut siihen, että et käytä Palveluita millään tavoin muiden osapuolten häiritsemiseen, vahingoittamiseen, varjostamiseen, uhkaamiseen, kunnian loukkaamiseen tai muuhun oikeuksien rikkomiseen tai loukkaamiseen, eikä Apple ole millään tavoin vastuussa tällaisesta toiminnastasi eikä mistään Palveluiden käytön seurauksena mahdollisesti vastaanottamistasi häiritsevistä, uhkaavista, kunniaa loukkaavista, loukkaavista tai laittomista viesteistä tai tiedonsiirroista.";
"Part31" = "F. Lisäksi Palvelut ja Muiden valmistajien aineisto, jota voidaan käyttää, linkittää tai näyttää Apple-ohjelmiston kautta, eivät ole käytettävissä kaikilla kielillä tai kaikissa maissa tai kaikilla alueilla. Apple ei esitä, että kyseiset Palvelut tai Muiden valmistajien aineisto sopisivat käytettäviksi tai olisivat käytettävissä missään tietyssä paikassa. Mikäli päätät käyttää tällaisia Palveluita tai Muiden valmistajien aineistoa, teet sen omasta aloitteestasi ja vastaat siitä, että käyttö on kaikkien sovellettavien lakien mukaista, mukaan lukien mutta niihin rajoittumatta sovellettavat paikalliset lait ja henkilötietoja ja tietojen keräämistä koskevat lait. Applella ja sen lisensoijilla on oikeus muuttaa, keskeyttää tai poistaa mitä tahansa Palveluita tai estää niiden käyttö koska tahansa asiasta ilmoittamatta. Apple ei missään olosuhteissa ole vastuussa näiden Palveluiden poistamisesta tai käytön estämisestä. Apple voi myös aina rajoittaa tiettyjen Palveluiden käyttöä tai rajoittaa niihin pääsyä ilman ilmoitusta tai korvausvelvollisuutta. ";
"Part32" = "5. Sopimuksen päättyminen. Tämä Lisenssi on voimassa kunnes toisin päätetään. Jos Lisenssin ehtoja ei noudateta, Lisenssin alaiset oikeutesi päättyvät automaattisesti tai niiden voimassaolo lakkaa muuten ilman erillistä ilmoitusta Applelta. Lisenssin voimassaolon päättyessä Apple-ohjelmiston käyttö on lopetettava ja kaikki ohjelmiston osittaisetkin kopiot on hävitettävä. Tämän Lisenssin kohdat 2I, 3, 4, 5, 6, 7, 8, 10 ja 11 pysyvät voimassa myös Lisenssin päättyessä mistä tahansa syystä.";
"Part33" = "6. Vastuuvapautus. ";
"Part34" = "A. Mikäli olet kuluttaja-asiakas (eli käytät Apple-ohjelmistoa muuhun kuin yritystoimintaan tai ammatilliseen tarkoitukseen), sinulla saattaa olla asuinmaassasi laillisia oikeuksia, jotka kieltävät seuraavien rajoitusten soveltamisen sinuun, ja mikäli rajoitukset on kielletty, niitä ei sovelleta sinuun. Jos haluat lisätietoja oikeuksistasi kuluttajana, ota yhteyttä paikalliseen kuluttajaneuvontaan.";
"Part35" = "B. YMMÄRRÄT JA HYVÄKSYT, ETTÄ SIINÄ MÄÄRIN KUIN SOVELLETTAVA LAKI SEN SALLII, APPLE-OHJELMISTON JA APPLE-OHJELMISTON KAUTTA SUORITETTAVIEN TAI KÄYTETTÄVIEN PALVELUIDEN KÄYTTÖ, TYYDYTTÄVÄ LAATU, SUORITUSKYKY, TARKKUUS JA TOIMINTA OVAT SINUN OMALLA VASTUULLASI. ";
"Part36" = "C. SIINÄ MÄÄRIN KUIN SOVELLETTAVA LAKI SEN SALLII, APPLE-OHJELMISTO JA PALVELUT TOIMITETAAN ”SELLAISINA KUIN NE OVAT” JA ”SELLAISINA KUIN NE OVAT SAATAVILLA” MAHDOLLISINE VIRHEINEEN JA ILMAN MINKÄÄNLAISIA TAKUITA, JA APPLE JA APPLEN LISENSOIJAT (JOITA KOHDISSA 6 JA 7 KUTSUTAAN YHTEISNIMITYKSELLÄ ”APPLE”) VAPAUTTAVAT ITSENSÄ SUORASTA, VÄLILLISESTÄ JA LAKISÄÄTEISESTÄ TUOTE- JA MUUSTA VASTUUSTA APPLE-OHJELMISTON JA PALVELUIDEN SUHTEEN MUKAAN LUKIEN KAUPPAKELPOISUUS, LAADUN TYYDYTTÄVYYS, SOVELTUVUUS TIETTYYN TARKOITUKSEEN, VIRHEETTÖMYYS, KÄYTÖN HÄIRITSEMÄTTÖMYYS JA KOLMANSIEN OSAPUOLTEN OIKEUKSIEN LOUKKAAMATTOMUUS. ";
"Part37" = "D. APPLE EI TAKAA, ETTÄ VOIT NAUTTIA APPLE-OHJELMISTOSTA TAI PALVELUISTA ILMAN HÄIRIÖITÄ TAI ETTÄ APPLE-OHJELMISTON SISÄLTÄMÄT TOIMINNOT TAI SEN SUORITTAMAT TAI TARJOAMAT PALVELUT TÄYTTÄVÄT KAIKKI VAATIMUKSET, ETTÄ APPLE-OHJELMISTON TAI PALVELUIDEN TOIMINTA ON KESKEYTYMÄTÖNTÄ JA VIRHEETÖNTÄ, ETTÄ MITKÄÄN PALVELUT SÄILYVÄT SAATAVILLA, ETTÄ APPLE-OHJELMISTO TAI PALVELUT TULLAAN KORJAAMAAN TAI ETTÄ APPLE-OHJELMISTO ON YHTEENSOPIVA MINKÄÄN MUIDEN VALMISTAJIEN OHJELMISTOJEN, APPIEN TAI PALVELUIDEN KANSSA. TÄMÄN APPLE-OHJELMISTON ASENNUS SAATTAA VAIKUTTAA KOLMANSIEN OSAPUOLTEN OHJELMISTOJEN, SOVELLUSTEN TAI PALVELUIDEN, KUTEN MYÖS APPLEN TUOTTEIDEN JA PALVELUIDEN, SAATAVUUTEEN JA KÄYTETTÄVYYTEEN. ";
"Part38" = "E. APPLE-OHJELMISTOA JA PALVELUITA EI OLE SUUNNITELTU KÄYTETTÄVIKSI TILANTEISSA TAI YMPÄRISTÖISSÄ, JOISSA APPLE-OHJELMISTON TAI PALVELUIDEN TOIMINTAHÄIRIÖ TAI AIKAVIIVE TAI NIIDEN TARJOAMAN SISÄLLÖN, DATAN TAI TIETOJEN VIRHE TAI EPÄTARKKUUS SAATTAA AIHEUTTAA KUOLEMAN, HENKILÖVAHINGON TAI VAKAVAN FYYSISEN TAI YMPÄRISTÖHAITAN, MUKAAN LUKIEN RAJOITUKSETTA YDINENERGIA-ALAN TOIMINTA, LENTOKONEEN NAVIGOINTI- TAI TIETOLIIKENNEJÄRJESTELMÄT, LENNONJOHTOJÄRJESTELMÄT, ELINTOIMINTOJA YLLÄPITÄVÄT JÄRJESTELMÄT JA ASEJÄRJESTELMÄT.";
"Part39" = "F. MIKÄÄN APPLEN TAI APPLEN VALTUUTTAMAN EDUSTAJAN ANTAMA SUULLINEN TAI KIRJALLINEN TIETO TAI OHJE EI LUO TAKUUTA. JOS APPLE-OHJELMISTO TAI PALVELUT TODETAAN VIALLISIKSI, SINÄ OLET VASTUUSSA KAIKISTA HUOLTO- JA KORJAUSKULUISTA. KOSKA JOILLAKIN OIKEUSTOIMIALUEILLA EI SALLITA VÄLILLISTEN TAKUIDEN POISSULKEMISTA TAI SOVELLETTAVIEN KULUTTAJAN LAKISÄÄTEISTEN OIKEUKSIEN RAJOITTAMISTA, EDELLÄ MAINITTU EI EHKÄ KOSKE SINUA. ";
"Part40" = "7. Vastuun rajoitus. SOVELLETTAVAN LAIN SALLIMISSA RAJOISSA JA HUOLIMATTA VASTUUTEORIASTA (SOPIMUKSEN, RIKKOMUKSEN TAI MUUN OSALTA) TAI SIITÄ, ETTÄ APPLEA OLISI VAROITETTU KYSEISEN VAHINGON MAHDOLLISUUDESTA, APPLE EI OLE MISSÄÄN TAPAUKSISSA VASTUUSSA MISTÄÄN HENKILÖVAHINGOISTA TAI SUORISTA, EPÄSUORISTA TAI VÄLILLISISTÄ VAHINGOISTA MUKAAN LUKIEN RAJOITUKSETTA VOITTOJEN MENETYKSET, TIEDON VIOITTUMINEN TAI HÄVIÄMINEN, TIEDON LÄHETTÄMISEN TAI VASTAANOTTAMISEN EPÄONNISTUMINEN, LIIKETOIMINNAN KESKEYTYMINEN TAI MUUT KAUPALLISET VAHINGOT TAI MENETYKSET, JOTKA JOHTUVAT APPLE-OHJELMISTON JA PALVELUIDEN TAI APPLE-OHJELMISTON YHTEYDESSÄ KÄYTETTÄVIEN MUIDEN VALMISTAJIEN OHJELMISTON TAI APPIEN KÄYTÖSTÄSI TAI KYVYTTÖMYYDESTÄSI KÄYTTÄÄ NIITÄ. KOSKA JOILLAKIN OIKEUSTOIMIALUEILLA EI SALLITA VASTUUN POISSULKEMISTA TAI RAJOITTAMISTA HENKILÖVAHINGOISSA TAI EPÄSUORISSA TAI VÄLILLISISSÄ VAHINGOISSA, EDELLÄ MAINITTU EI EHKÄ KOSKE SINUA. Missään tapauksessa Applen kokonaiskorvausvelvollisuus vahingoista (ellei sovellettavan lain vaatimus henkilövahinkotapauksissa poikkea tästä) ei ylitä viittäkymmentä Yhdysvaltain dollaria (50,00 USD). Edellä olevat rajoitukset ovat voimassa myös silloin, jos yllä esitetty korvaus ei vastaa perimmäistä tarkoitustaan.";
"Part41" = "8. Vientisäätely. Sitoudut siihen, ettei Apple-ohjelmistoa viedä edelleen suorasti eikä epäsuorasti ulkomaille, ellei tähän ole erikseen annettu lupaa Yhdysvaltain tai sen oikeustoimialueen/niiden oikeustoimialueiden laeissa, jo(i)sta Apple-ohjelmisto on hankittu. Erityisesti Apple-ohjelmistoa ei saa viedä suorasti tai epäsuorasti (a) Yhdysvaltojen vientikiellossa olevaan maahan tai (b) kenellekään U.S. Treasury Departmentin Specially Designated Nationals -luettelossa olevalle tai U.S. Department of Commercen Denied Person’s List- tai Entity List -luetteloissa tai missään muissa rajoitusten alaisten osapuolten luetteloissa olevalle. Apple-ohjelmistoa käyttämällä annat takuun siitä, ettet ole missään tällaisessa maassa tai luettelossa. Takaat myös, että et käytä Apple-ohjelmistoa mihinkään sellaiseen tarkoitukseen, joka on kielletty Yhdysvaltain laissa, mukaan lukien (mutta näihin rajoittumatta) ohjusten, ydinaseiden tai kemiallisten tai biologisten aseiden kehitys, suunnittelu, valmistus tai tuotanto. ";
"Part42" = "9. Yhdysvaltain viranomaiset. Apple-ohjelmisto ja siihen liittyvä dokumentaatio ovat ”Commercial Items”, kuten termi on määritelty säädöksessä 48 C.F.R. §2.101, koostuen osista ”Commercial Computer Software” ja ”Commercial Computer Software Documentation”, kuten termit on määritelty säädöksessä 48 C.F.R.§12.212 tai 48 C.F.R. §227.7202, soveltuvin osin. Mikäli Lisenssin hankkija tai käyttäjä on Yhdysvaltain viranomainen, sovelletaan säädöksiä 48 C.F.R. §12.212 tai 48 C.F.R. §227.7202-1 - 227.7202-4, soveltuvin osin, niin, että Commercial Computer Software ja Commercial Computer Software Documentation on lisensoitu (a) vain Commercial Item -tuotteina ja (b) samoilla näissä sopimusehdoissa ilmoitetuilla oikeuksilla, jotka koskevat kaikkia muita loppukäyttäjiä. Julkaisemattoman materiaalin oikeudet pidätetään Yhdysvaltojen tekijänoikeuslakien mukaisesti.";
"Part43" = "10. Sovellettava laki ja sopimuksen osien riippumattomuus. Tähän Lisenssiin ja sen tulkintaan sovelletaan Kalifornian osavaltion lakeja, lukuun ottamatta niihin sisältyviä lainvalintaa koskevia säädöksiä. Tämä Lisenssi ei kuulu United Nations Convention on Contracts for the International Sale of Goods -määräysten alaisuuteen. Jos olet Isossa-Britanniassa asuva kuluttaja, tähän Lisenssiin sovelletaan asuinpaikkasi oikeustoimialueen lakeja. Vaikka toimivaltainen tuomioistuin katsoisi, ettei Lisenssin jotakin osaa voida pakottaa täytäntöönpantavaksi, Lisenssi on muilta osin voimassa.";
"Part44" = "11. Kokonaissopimus ja kieli. Tämä Lisenssi muodostaa koko sopimuksen sinun ja Applen välillä Apple-ohjelmistoa koskien ja korvaa kaikki aiemmat tai samanaikaiset samaa koskevat sopimukset. Lisenssin lisäykset tai muutokset eivät ole sitovia ilman kirjallista, Applen allekirjoittamaa hyväksyntää. Lisenssin käännökset on tehty paikallisia vaatimuksia ajatellen ja mahdolliset epäselvyydet englanninkielisen version ja käännösversion välillä ratkaistaan englanninkielisen lisenssiversion eduksi sikäli kuin oikeustoimialueesi paikallinen lainsäädäntö ei sitä estä.";
"Part45" = "12. Muiden valmistajien materiaali. Osa Apple-ohjelmistosta saattaa käyttää tai sisältää muiden valmistajien ohjelmistoja ja muuta tekijänoikeudella suojattua materiaalia. Tällaisen materiaalin lähdemaininnat, lisenssiehdot ja vastuuvapauslausekkeet ovat Apple-ohjelmiston sähköisessä dokumentaatiossa, ja tällaisen materiaalin käyttöä koskevat kyseisen valmistajan ehdot.";
"Part46" = "EA1576";
"Part47" = "16.8.2018";